[
  {
    "title": "Laser Game",
    "date": "1 de Enero de 2024",
    "content": "# Mi Último Proyecto Maker 🎮🔫\n\n¡Acabo de terminar un proyecto de dos semanas y estoy emocionado de compartirlo! 🚀 Se trata de un juego de disparos láser donde apuntas a objetivos que cambian de color utilizando LEDs Neopixel, todo mientras un temporizador lleva el registro de tu progreso. Desarrollé esto para Aliados Lasertag, la única arena de Lasertag en Pamplona que abrió sus puertas en diciembre pasado. ¡Presentamos el proyecto en el Baluarte de Pamplona del 1 al 3 de marzo durante el evento ExpoFamily, y fue todo un éxito! 💥\n\nAquí tienes algunos detalles clave:\n- **Hardware**: Utilicé placas de desarrollo ESP-32, anillos LED de Neopixel, sensores infrarrojos y una matriz de Neopixel de 16x48px.\n- **Comunicación**: Todo se comunica de forma inalámbrica gracias al protocolo ESP-NOW.\n- **Jugabilidad**: Al presionar el botón, todos los objetivos se vuelven rojos y después de una cuenta regresiva de 3 segundos, comienza el temporizador. Los objetivos se encienden y apagan aleatoriamente en rojo, y solo puedes dispararles cuando están encendidos. Al golpear un objetivo, su color cambia a verde. Una vez que los has golpeado todos, el temporizador se detiene.\n- **Mi Rol**: Me encargué del diseño tanto del hardware como del software, además de crear modelos en 3D para las carcasas de los objetivos. Aimar Romeo de @3daromeo en Instagram dio vida a estos modelos con impresión 3D.\n\n¡Mira algunos videos y fotos del proceso y los resultados a continuación! Si estás interesado o simplemente quieres saber más, ¡no dudes en ponerte en contacto! 👾\n\n![Img 1](https://media.licdn.com/dms/image/D4D22AQF5uh428-QRcg/feedshare-shrink_1280/0/1709834948948?e=1718236800&v=beta&t=F8bnN69lrhKuIGdGj8uGEwwHjIJ_lG0UwMuKuLIQ8Pk)\n![Placeholder Image 2](https://media.licdn.com/dms/image/D4D22AQHkKxwVsIkXRw/feedshare-shrink_1280/0/1709834948053?e=1718236800&v=beta&t=UWEuW4Rjl5dvF1K0c_yhi_qib2mRcBuQQRzHImSd4fs)\n![Placeholder Image 3](https://media.licdn.com/dms/image/D4D22AQGG0rlsNoYbgQ/feedshare-shrink_1280/0/1709834947904?e=1718236800&v=beta&t=SFSvC1TMZ45rVy3GvCAggqyh02-Rdf-XD36BrgrxgXU)\n![Placeholder Image 4](https://media.licdn.com/dms/image/D4D22AQFVTBw_ikEgrg/feedshare-shrink_1280/0/1709834944225?e=1718236800&v=beta&t=uJK1x5ARkBUMDTeu94B8erVK6rg8h_dm59CKbeYtgsQ)\n\n\\#LaserTag #DIY #ESP32 #Maker #Programming #Makespace #Arduino\n"
  }
]
